{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "28"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_bias", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "28"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv1", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "28"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "prelu1_gamma", 
      "attr": {
        "__init__": "[\"Constant\", {\"value\": 0.25}]", 
        "act_type": "prelu"
      }, 
      "inputs": []
    }, 
    {
      "op": "LeakyReLU", 
      "name": "prelu1", 
      "attr": {"act_type": "prelu"}, 
      "inputs": [[3, 0, 0], [4, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pool1", 
      "attr": {
        "kernel": "(3, 3)", 
        "pool_type": "max", 
        "pooling_convention": "full", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[5, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "48"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_bias", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "48"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv2", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "48"
      }, 
      "inputs": [[6, 0, 0], [7, 0, 0], [8, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "prelu2_gamma", 
      "attr": {
        "__init__": "[\"Constant\", {\"value\": 0.25}]", 
        "act_type": "prelu"
      }, 
      "inputs": []
    }, 
    {
      "op": "LeakyReLU", 
      "name": "prelu2", 
      "attr": {"act_type": "prelu"}, 
      "inputs": [[9, 0, 0], [10, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pool2", 
      "attr": {
        "kernel": "(3, 3)", 
        "pool_type": "max", 
        "pooling_convention": "full", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[11, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv3_weight", 
      "attr": {
        "kernel": "(2, 2)", 
        "num_filter": "64"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_bias", 
      "attr": {
        "kernel": "(2, 2)", 
        "num_filter": "64"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv3", 
      "attr": {
        "kernel": "(2, 2)", 
        "num_filter": "64"
      }, 
      "inputs": [[12, 0, 0], [13, 0, 0], [14, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "prelu3_gamma", 
      "attr": {
        "__init__": "[\"Constant\", {\"value\": 0.25}]", 
        "act_type": "prelu"
      }, 
      "inputs": []
    }, 
    {
      "op": "LeakyReLU", 
      "name": "prelu3", 
      "attr": {"act_type": "prelu"}, 
      "inputs": [[15, 0, 0], [16, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fc1_weight", 
      "attr": {"num_hidden": "128"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc1_bias", 
      "attr": {"num_hidden": "128"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fc1", 
      "attr": {"num_hidden": "128"}, 
      "inputs": [[17, 0, 0], [18, 0, 0], [19, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "prelu4_gamma", 
      "attr": {
        "__init__": "[\"Constant\", {\"value\": 0.25}]", 
        "act_type": "prelu"
      }, 
      "inputs": []
    }, 
    {
      "op": "LeakyReLU", 
      "name": "prelu4", 
      "attr": {"act_type": "prelu"}, 
      "inputs": [[20, 0, 0], [21, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fc2_weight", 
      "attr": {"num_hidden": "2"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc2_bias", 
      "attr": {"num_hidden": "2"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fc2", 
      "attr": {"num_hidden": "2"}, 
      "inputs": [[22, 0, 0], [23, 0, 0], [24, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "label", 
      "inputs": []
    }, 
    {
      "op": "SoftmaxOutput", 
      "name": "cls_prob", 
      "attr": {
        "out_grad": "True", 
        "use_ignore": "True"
      }, 
      "inputs": [[25, 0, 0], [26, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fc3_weight", 
      "attr": {"num_hidden": "4"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc3_bias", 
      "attr": {"num_hidden": "4"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fc3", 
      "attr": {"num_hidden": "4"}, 
      "inputs": [[22, 0, 0], [28, 0, 0], [29, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bbox_target", 
      "inputs": []
    }, 
    {
      "op": "LinearRegressionOutput", 
      "name": "bbox_pred", 
      "attr": {
        "grad_scale": "1", 
        "out_grad": "True"
      }, 
      "inputs": [[30, 0, 0], [31, 0, 0]]
    }, 
    {
      "op": "Custom", 
      "name": "negative_mining", 
      "attr": {"op_type": "negativemining"}, 
      "inputs": [[27, 0, 0], [32, 0, 0], [26, 0, 0], [31, 0, 0]]
    }
  ], 
  "arg_nodes": [
    0, 
    1, 
    2, 
    4, 
    7, 
    8, 
    10, 
    13, 
    14, 
    16, 
    18, 
    19, 
    21, 
    23, 
    24, 
    26, 
    28, 
    29, 
    31
  ], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    9, 
    10, 
    11, 
    12, 
    13, 
    14, 
    15, 
    16, 
    17, 
    18, 
    19, 
    20, 
    21, 
    22, 
    23, 
    24, 
    25, 
    26, 
    27, 
    28, 
    29, 
    30, 
    31, 
    32, 
    33, 
    37
  ], 
  "heads": [[33, 0, 0], [33, 1, 0], [33, 2, 0], [33, 3, 0]], 
  "attrs": {"mxnet_version": ["int", 1100]}
}